/* Задача 12. Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если число 2 не кратно числу 1, то программа выводит остаток от деления.
34, 5 -> не кратно, остаток 4
16, 4 -> кратно */

/*
Console.WriteLine("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int b = Convert.ToInt32(Console.ReadLine());
if (a % b == 0)
{
    Console.WriteLine($"Число {b} кратно числу {a}");
}
else
{
    Console.WriteLine($"Остаток  {a % b}");
}
*/

/*
Console.WriteLine("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int b = Convert.ToInt32(Console.ReadLine());
switch (a % b)
{
    case 0:
        Console.WriteLine($"Число {b} кратно числу {a}");
        break;
    default:
        Console.WriteLine($"Остаток  {a % b}");
        break;
}
*/

